## ╭──────────────────────────────────────────────╮
## │                    Taps                      │
## ╰──────────────────────────────────────────────╯

tap "amazon/amazon", "ssh://git.amazon.com/pkg/HomebrewAmazon"
tap "aws/tap"
tap "jandedobbeleer/oh-my-posh"
tap "nikitabobko/tap"

## ╭──────────────────────────────────────────────╮
## │                  Formulae                    │
## ╰──────────────────────────────────────────────╯

brew "xz"
brew "openssl@3"
brew "libyaml"
brew "aws-sam-cli"
brew "bash-language-server"
brew "cairo"
brew "fd"
brew "fzf"
brew "google-java-format"
brew "python@3.12"
brew "librsvg"
brew "graphviz"
brew "jdtls"
brew "jq"
brew "libffi"
brew "lua-language-server"
brew "marksman"
brew "mise"
brew "mypy"
brew "neovim"
brew "oh-my-posh"
brew "pyright"
brew "rbenv"
brew "ruby"
brew "ruff"
brew "shfmt"
brew "stylua"
brew "tcl-tk"
brew "tmux"
brew "tree"
brew "unison"
brew "xsel"
brew "yaml-language-server"
brew "zlib"
brew "amazon/amazon/ninja-dev-sync"

## ╭──────────────────────────────────────────────╮
## │                   Casks                      │
## ╰──────────────────────────────────────────────╯

cask "aerospace"
cask "alacritty"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
