## ╭──────────────────────────────────────────────╮
## │                    Taps                      │
## ╰──────────────────────────────────────────────╯

tap "nikitabobko/tap" # For aerospace

## ╭──────────────────────────────────────────────╮
## │                  Formulae                    │
## ╰──────────────────────────────────────────────╯

# Rust
brew "rustup"

# Java 
brew "gradle"
brew "jdtls"
brew "google-java-format"

# Python
brew "pyright"
brew "mypy"
brew "ruff"

# Lua
brew "lua-language-server"
brew "stylua"

# Ruby
brew "mise" # Not Ruby specific, but that's all I use it for

# Markdown
brew "marksman"

# Yaml
brew "yaml-language-server"

# Bash
brew "bash-language-server"
brew "shfmt"

# JSON
brew "jq"

# Tmux
brew "tmux"
brew "tpm"

# CLI tools
brew "fd"
brew "neovim"
brew "oh-my-posh"
brew "fzf"
brew "tree"
brew "aws-sam-cli"
brew "zinit"

# Misc
brew "xz"
brew "openssl@3"
brew "libyaml"
brew "cairo"
brew "librsvg"
brew "graphviz"
brew "libffi"
brew "tcl-tk"
brew "unison"
brew "xsel"
brew "zlib"

## ╭──────────────────────────────────────────────╮
## │                   Casks                      │
## ╰──────────────────────────────────────────────╯

cask "aerospace"
cask "alacritty"
cask "karabiner-elements"
cask "font-jetbrains-mono-nerd-font"
cask "temurin" # java
